{
  "projetos": [
    {
      "categoria": "Projeto academico",
      "semestre": "Terceiro Semestre (2024-2)",
      "nome": "Portal de Transparência FAPG",
      "professor_parceiro": "Fatec - Prof. Gerson Da Penha Neto",
      "problema": "A fundação enfrentava a necessidade de uma solução para melhorar a transparência pública sobre os projetos e pesquisas em andamento, facilitando o acesso às informações.",
      "solucao": "Desenvolvemos um portal integrado com uma API que permite a criação, edição e gestão de projetos, fornecendo uma visão clara e acessível das iniciativas da fundação.",
      "repositorio": "https://github.com/joaogabgr/API-2024.2-3SEM",
      "tecnologias": {
        "Spring Boot": "Desenvolvimento Backend",
        "Java": "Lógica de Backend",
        "Python": "Processamento de Dados",
        "React": "Desenvolvimento Frontend",
        "TypeScript": "Script Frontend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Atuei como desenvolvedor, implementando funcionalidades na API e assegurando a integração eficiente entre backend e frontend. Também ofereci suporte técnico à equipe, auxiliando na resolução de problemas técnicos e organizacionais. Colaborei diretamente na adaptação do projeto para atender novos requisitos do cliente, mesmo enfrentando desafios como alterações em funcionalidades já finalizadas. Contribuí para reorganizar as atividades da equipe, garantindo entregas no prazo estipulado.",
      "hard_skills": {
        "Spring Boot": "Faço com ajuda",
        "React": "Faço de forma independente",
        "MySQL": "Faço de forma independente"
      },
      "soft_skills": {
        "Organização": "Diante dos desafios causados pela entrada de novos membros na equipe, tive que me reorganizar para garantir que as tarefas fossem entregues no prazo e com qualidade. Esse processo me ajudou a melhorar minha habilidade de organização e gestão de tempo, permitindo uma entrega mais eficiente e pontual.",
        "Resolução de Problemas": "Durante a última sprint, enfrentamos problemas técnicos no backend, onde precisei colaborar com outro membro da equipe para resolver uma tarefa que já estava marcada como finalizada. Esse desafio me ajudou a desenvolver habilidades de resolução de problemas e a trabalhar de forma colaborativa para entregar soluções eficientes.",
        "Comunicação": "Aprendi a importância de uma comunicação clara e eficiente dentro da equipe, especialmente após enfrentarmos dificuldades de alinhamento nas fases iniciais. Trabalhei para melhorar a comunicação, o que foi essencial para o bom andamento do projeto."
      }
    },
    {
      "categoria": "Projeto academico",
      "semestre": "Segundo Semestre (2024-1)",
      "nome": "Service Desk",
      "professor_parceiro": "Fatec - Prof. Claudio Etelvino de Lima",
      "problema": "A ausência de um sistema centralizado dificultava o registro e acompanhamento de solicitações, prejudicando a comunicação entre alunos e equipe de suporte.",
      "solucao": "Criamos um sistema que centraliza o registro, acompanhamento e resolução de solicitações, melhorando a comunicação e agilizando o atendimento.",
      "repositorio": "https://github.com/joaogabgr/API-DESK",
      "tecnologias": {
        "TypeScript": "Desenvolvimento Backend",
        "Node.js": "Servidor Backend",
        "React": "Desenvolvimento Frontend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Implementei funcionalidades como criação de tickets, atribuição automática e notificações de status. Também contribui na integração dos dados para melhorar a experiência do usuário e participei ativamente na resolução de desafios técnicos, como bugs críticos e ajustes em funcionalidades. Além disso, ajudei a organizar a equipe, promovendo reuniões para discutir dificuldades e estratégias para melhorar a colaboração, o que resultou em entregas mais alinhadas e pontuais.",
      "hard_skills": {
        "Node.js": "Faço de forma independente",
        "TypeScript": "Faço de forma independente",
        "MySQL": "Faço de forma independente",
        "React": "Faço de forma independente"
      },
      "soft_skills": {
        "Proatividade": "Nas duas primeiras entregas do projeto, percebi que a equipe enfrentava dificuldades com a falta de proatividade, o que comprometia o andamento das tarefas. Com base nas lições aprendidas com meus próprios erros, tomei a iniciativa de organizar reuniões regulares para garantir um melhor alinhamento entre os membros. Isso ajudou a evitar imprevistos e entregas de última hora. No meu caso, ao ter que trabalhar intensamente no último fim de semana para concluir minhas atividades, aprendi a importância de agir antecipadamente",
        "Resiliência": "Enfrentei e solucionei bugs críticos durante o desenvolvimento, mantendo o foco na qualidade das entregas e nos prazos estipulados. Essa experiência me ajudou a fortalecer minha capacidade de resiliência diante de desafios técnicos complexos.",
        "Gestão de Tempo": "Aprendi a organizar as tarefas em etapas menores e priorizar as mais urgentes, o que me ajudou a garantir entregas consistentes e dentro do prazo. Essa abordagem foi essencial para manter o fluxo de trabalho produtivo."
      }
    },
    {
      "categoria": "Projeto academico",
      "semestre": "Primeiro Semestre (2023-2)",
      "nome": "Nefrologia Pediátrica",
      "professor_parceiro": "Fatec - Prof. Fernando Massanori Ashikaga",
      "problema": "Mães de crianças com problemas renais enfrentavam dificuldade para acessar informações de suporte, devido à dispersão dos dados e falta de um local centralizado para troca de experiências.",
      "solucao": "Desenvolvemos um site com um blog integrado, permitindo que as mães compartilhassem experiências e acessassem informações unificadas sobre nefrologia pediátrica.",
      "repositorio": "https://github.com/joaogabgr/API-NEFRO",
      "tecnologias": {
        "Flask": "Desenvolvimento Backend",
        "Python": "Lógica de Backend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Implementei o blog do site, utilizando Flask e integrando-o ao banco de dados. Fui responsável pela coleta e organização inicial dos dados, assegurando que o sistema atendesse às necessidades do público-alvo. Além disso, promovi uma abordagem colaborativa, incentivando a equipe a superar desafios técnicos por meio de aprendizado mútuo.",
      "hard_skills": {
        "Flask Framework": "Faço de forma independente",
        "Python": "Faço de forma independente",
        "MySQL": "Faço de forma independente",
        "HTML": "Faço de forma independente"
      },
      "soft_skills": {
        "Empatia": "Eu realmente me aprofundei nas necessidades das mães e fiz questão de criar um ambiente funcional e acolhedor no site. Isso me permitiu entender melhor o impacto de um projeto bem feito na vida de outras pessoas.",
        "Trabalho em Equipe": "Liderei a equipe na superação de dificuldades técnicas e sempre procurei incentivar a colaboração entre os membros. Essa abordagem ajudou todos a aprenderem juntos, contribuindo para o sucesso do projeto."
      }
    },
    {
      "categoria": "Projeto pessoal",
      "nome": "OrbitChat",
      "descrição": "Uma plataforma de mídia social inspirada no Twitter, onde os usuários podem criar postagens, seguir outros usuários, curtir postagens e compartilhar conteúdo, oferecendo uma experiência dinâmica e interativa.",
      "repositorio": "https://github.com/joaogabgr/OrbitChat",
      "tecnologias": {
        "Python": "Desenvolvimento Backend",
        "Flask": "Framework Backend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "JavaScript": "Script Frontend",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Desenvolvi o sistema de postagens, funcionalidades de seguir e curtir usuários, e implementei o backend com Flask, garantindo uma interação fluida entre os usuários.",
      "hard_skills": {
        "Flask Framework": "Faço de forma independente",
        "Desenvolvimento Frontend": "Faço de forma independente",
        "Design de Banco de Dados": "Faço de forma independente",
        "Sistemas de Mídia Social": "Faço com ajuda"
      }
    }
  ]
}
