{
  "projetos": [
    {
      "categoria": "Projeto academico",
      "semestre": "Terceiro Semestre (2024-2)",
      "nome": "Portal de Transparência FAPG",
      "professor_parceiro": "Fatec - Prof. Gerson Da Penha Neto",
      "problema": "A fundação enfrentava a necessidade de uma solução para melhorar a transparência pública sobre os projetos e pesquisas em andamento, facilitando o acesso às informações.",
      "solucao": "Desenvolvemos um portal integrado com uma API que permite a criação, edição e gestão de projetos, fornecendo uma visão clara e acessível das iniciativas da fundação.",
      "repositorio": "https://github.com/joaogabgr/API-2024.2-3SEM",
      "tecnologias": {
        "Spring Boot": "Desenvolvimento Backend",
        "Java": "Lógica de Backend",
        "Python": "Processamento de Dados",
        "React": "Desenvolvimento Frontend",
        "TypeScript": "Script Frontend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Atuei como desenvolvedor, implementando funcionalidades na API e assegurando a integração eficiente entre backend e frontend. Também ofereci suporte técnico à equipe, auxiliando na resolução de problemas técnicos e organizacionais. Colaborei diretamente na adaptação do projeto para atender novos requisitos do cliente, mesmo enfrentando desafios como alterações em funcionalidades já finalizadas. Contribuí para reorganizar as atividades da equipe, garantindo entregas no prazo estipulado.",
      "hard_skills": {
        "Spring Boot": "Faço com ajuda",
        "React": "Faço de forma independente",
        "MySQL": "Faço de forma independente"
      },
      "soft_skills": {
        "Organização": "Junto com a equipe, identificamos problemas na distribuição de tarefas após a entrada de novos integrantes. Para resolver isso, aprimoramos nossa comunicação durante as reuniões diárias (Daily), compartilhando o progresso das atividades e alinhando melhor as responsabilidades.",
        "Resolução de Problemas": "Em colaboração com a equipe, buscamos a maneira mais eficiente de implementar os novos requisitos do cliente, mesmo que isso exigisse modificar funcionalidades já concluídas, assegurando a qualidade e a integridade do produto final.",
        "Trabalho em Equipe": "Facilitei a integração entre backend e frontend, promovendo um ambiente colaborativo para superar desafios técnicos e organizacionais.",
        "Comunicação": "Com os problemas de comunicação enfrentados pela equipe, aprendemos a importância de uma comunicação eficiente para o bom andamento do projeto."
      }
    },
    {
      "categoria": "Projeto academico",
      "semestre": "Segundo Semestre (2024-1)",
      "nome": "Service Desk",
      "professor_parceiro": "Fatec - Prof. Claudio Etelvino de Lima",
      "problema": "A ausência de um sistema centralizado dificultava o registro e acompanhamento de solicitações, prejudicando a comunicação entre alunos e equipe de suporte.",
      "solucao": "Criamos um sistema que centraliza o registro, acompanhamento e resolução de solicitações, melhorando a comunicação e agilizando o atendimento.",
      "repositorio": "https://github.com/joaogabgr/API-DESK",
      "tecnologias": {
        "TypeScript": "Desenvolvimento Backend",
        "Node.js": "Servidor Backend",
        "React": "Desenvolvimento Frontend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Implementei funcionalidades como criação de tickets, atribuição automática e notificações de status. Também contribuí na integração dos dados para melhorar a experiência do usuário e participei ativamente na resolução de desafios técnicos, como bugs críticos e ajustes em funcionalidades. Além disso, ajudei a organizar a equipe, promovendo reuniões para discutir dificuldades e estratégias para melhorar a colaboração, o que resultou em entregas mais alinhadas e pontuais.",
      "hard_skills": {
        "Node.js": "Faço de forma independente",
        "TypeScript": "Faço de forma independente",
        "MySQL": "Faço de forma independente",
        "React": "Faço de forma independente"
      },
      "soft_skills": {
        "Proatividade": "Nas primeiras sprints, identificamos problemas de entregas e comprometimento da equipe. Junto com o Scrum Master e a Product Owner, organizei reuniões para entender as dificuldades enfrentadas e propor melhorias. Essas ações ajudaram a aumentar a produtividade e a comunicação, promovendo um melhor alinhamento entre os membros da equipe.",
        "Resiliência": "Enfrentei e solucionei bugs críticos e desafios técnicos, mantendo a qualidade das entregas dentro dos prazos estipulados.",
        "Gestão de Tempo": "Organizei as tarefas em etapas menores e priorizei as mais urgentes, garantindo entregas consistentes."
      }
    },
    {
      "categoria": "Projeto academico",
      "semestre": "Primeiro Semestre (2023-2)",
      "nome": "Nefrologia Pediátrica",
      "professor_parceiro": "Fatec - Prof. Fernando Massanori Ashikaga",
      "problema": "Mães de crianças com problemas renais enfrentavam dificuldade para acessar informações de suporte, devido à dispersão dos dados e falta de um local centralizado para troca de experiências.",
      "solucao": "Desenvolvemos um site com um blog integrado, permitindo que as mães compartilhassem experiências e acessassem informações unificadas sobre nefrologia pediátrica.",
      "repositorio": "https://github.com/joaogabgr/API-NEFRO",
      "tecnologias": {
        "Flask": "Desenvolvimento Backend",
        "Python": "Lógica de Backend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Implementei o blog do site, utilizando Flask e integrando-o ao banco de dados. Fui responsável pela coleta e organização inicial dos dados, assegurando que o sistema atendesse às necessidades do público-alvo. Além disso, promovi uma abordagem colaborativa, incentivando a equipe a superar desafios técnicos por meio de aprendizado mútuo.",
      "hard_skills": {
        "Flask Framework": "Faço de forma independente",
        "Python": "Faço de forma independente",
        "MySQL": "Faço de forma independente",
        "HTML": "Faço de forma independente"
      },
      "soft_skills": {
        "Empatia": "Aprofundei-me nas necessidades das mães, criando um ambiente funcional e acolhedor no site.",
        "Trabalho em Equipe": "Liderei a equipe na superação de dificuldades técnicas, promovendo colaboração e aprendizado mútuo."
      }
    },
    {
      "categoria": "Projeto pessoal",
      "nome": "OrbitChat",
      "descrição": "Uma plataforma de mídia social inspirada no Twitter, onde os usuários podem criar postagens, seguir outros usuários, curtir postagens e compartilhar conteúdo, oferecendo uma experiência dinâmica e interativa.",
      "repositorio": "https://github.com/joaogabgr/OrbitChat",
      "tecnologias": {
        "Python": "Desenvolvimento Backend",
        "Flask": "Framework Backend",
        "HTML": "Estrutura Web",
        "CSS": "Estilização Web",
        "JavaScript": "Script Frontend",
        "MySQL": "Gestão de Banco de Dados"
      },
      "contribuicoes_pessoais": "Desenvolvi o sistema de postagens, funcionalidades de seguir e curtir usuários, e implementei o backend com Flask, garantindo uma interação fluida entre os usuários.",
      "hard_skills": {
        "Flask Framework": "Faço de forma independente",
        "Desenvolvimento Frontend": "Faço de forma independente",
        "Design de Banco de Dados": "Faço de forma independente",
        "Sistemas de Mídia Social": "Faço com ajuda"
      }
    }
  ]
}
